---
kind: type
id: T:Autodesk.Revit.DB.SkyBackgroundSettings
source: html/f41fa5bf-3973-9545-048e-c2870c29c636.htm
---
# Autodesk.Revit.DB.SkyBackgroundSettings

Represents the rendering sky background settings.

## Syntax (C#)
```csharp
public class SkyBackgroundSettings : BackgroundSettings
```